#########################################################################
# 任务1：编写一个函数，返回输入的集合中的最大值和最小值
#########################################################################
import math
print('【任务1开始】', '=' * 100)


# 返回集合中的最大值和最小值
# arr：List类型集合
# 返回值：将最大值和最小值同时返回

def find_max_min(arr):
    # 设置最大值和最小值的初值
    min_value = math.inf
    max_value = -math.inf
    for data in arr:            # 遍历每个元素
        # 如果当前元素大于最大值，则将当前元素指定为新的最大值
        if data > max_value:  # ____【1】____:
            max_value = data
        # 如果当前元素小于最小值，则将当前元素指定为新的最小值
        if data < min_value:  # ____【2】____:
            min_value = data
    return max_value, min_value


# 生成一个集合
source = [39, 100, 20, 100, 0, 12, 56, 89, 6, 27]

max, min = find_max_min(source)
print("最大值：%d, 最小值：%d" % (max, min))

print('【任务1结束】', '=' * 100)


#########################################################################
# 任务2：检测字符串是否符合要求
# 字符串必须同时符合下列要求：
# (1)长度不少于8个字符
# (2)只能包含英文和数字，不能包含其它字符
# (3)不能只包含数字
#########################################################################
print('【任务2开始】', '=' * 100)

# 判断字符串是否符合要求
# 如果符合所有要求则返回True，否则返回False


def check_string(s):
    if len(s) < 8:  # ____【3】____(s) < 8          # 长度判断
        return False
    if not s.isalnum():     # 字母和数字判断
        return False  # ____【4】____
    if s.isdigit():  # ____【5】____():         # 是否仅包含数字
        return False
    return True  # ____【6】____


test_str = ['Hello123', 'Hello', '12345678', 'Hello@123', '1234.567']
for str in test_str:
    print('字符串【%s】检查结果：%s' % (str, check_string(str)))

print('【任务2结束】', '=' * 100)
